app/views/admins/search_customer.html.erb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= car.status %></td>
        <% @admin=Admin.find(params[:id_admin]) %>
        <% @customer=Customer.find(params[:id_customer]) %>