app/views/admins/show_car_customer.html.erb

<% @car=Car.find(params[:id_car]) %>
<% @customer=Customer.find(params[:id_customer]) %>
<% @admin=Admin.find(params[:id_admin]) %>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

<% else%>
    <% @record = Record.find(@customer.recordid) %>
---
SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]