app/views/customers/show.html.erb

    <% if @customer.recordid < 0 %>
      <%  car = Car.find( -1- @customer.recordid )%>
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]