app/views/customers/showcar_customer.html.erb

SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% else%>
    <% @record = Record.find(@customer.recordid) %>