app/controllers/admins_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show_customer
    @admin=Admin.find(params[:id_admin])
    @customer=Customer.find(params[:id_customer])

INSERT INTO "admins" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "admin1"], ["email", "admin1@email.com"], ["created_at", "2017-09-22 20:38:24.983366"], ["updated_at", "2017-09-22 20:38:24.983366"]]
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

SELECT "customers".* FROM "customers"
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def all_customers
    @customers=Customer.all
    @admin=Admin.find(params[:id])

SELECT "cars".* FROM "cars"
---
  def search_customer
    #  set_customer if @customer.nil?
    q = params[:q]
    if q.nil? || q.blank?
      @cars = Car.all

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Reserved"], ["updated_at", "2017-09-26 01:16:59.213015"], ["id", 1]]
UPDATE "customers" SET "recordid" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["recordid", -2], ["updated_at", "2017-09-26 01:16:59.216990"], ["id", 5]]
---
  def reserve_customer
    @car=Car.find(params[:id_car])
    @customer=Customer.find(params[:id_customer])
    @admin=Admin.find(params[:id_admin])
    require "date"
    starttime = DateTime.new(params[:start_date][:year].to_i, params[:start_date][:month].to_i, params[:start_date][:day].to_i, params[:start_date][:hour].to_i, params[:start_date][:minute].to_i,59,'-4')

    if starttime  < Time.now || starttime > Time.now + 7.days
      respond_to do |format|
        format.html { redirect_to show_admin_customer_car_path, notice: 'Start Time is not valid.' }
        format.json { head :no_content }
      end
    else
      @car.update(status: 'Reserved')
      @customer.update_attribute(:recordid, "#{-1 - @car.id}")

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "records" ("car_id", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?)  [["car_id", 1], ["created_at", "2017-09-26 01:45:04.546579"], ["updated_at", "2017-09-26 01:45:04.546579"], ["customer_id", 5]]
UPDATE "customers" SET "recordid" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["recordid", 5], ["updated_at", "2017-09-26 01:45:04.549430"], ["id", 5]]
UPDATE "records" SET "start" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["start", "2017-09-26 01:45:04"], ["updated_at", "2017-09-26 01:45:04.552645"], ["id", 5]]
---
  def checkout_customer
    @car=Car.find(params[:id_car])
    @customer=Customer.find(params[:id_customer])
    @admin=Admin.find(params[:id_admin])
    @car.update(status: 'Checked out')
    arecord = Record.new()
    arecord.customer= @customer
    arecord.car = @car
    now = Time.current
    arecord.save
    @customer.update_attribute(:recordid, "#{arecord.id}")

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Available"], ["updated_at", "2017-09-26 01:47:09.336009"], ["id", 1]]
SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "customers" SET "recordid" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["recordid", nil], ["updated_at", "2017-09-26 01:47:09.356881"], ["id", 5]]
UPDATE "records" SET "end" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["end", "2017-09-26 01:47:09"], ["updated_at", "2017-09-26 01:47:09.343495"], ["id", 5]]
---
  def return_customer
    @car=Car.find(params[:id_car])
    @customer=Customer.find(params[:id_customer])
    @admin=Admin.find(params[:id_admin])
    @car.update(status: 'Available')
    now = Time.current
    @record = Record.find(@customer.recordid)
    @record.update_attribute(:end, "#{now}")

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show_car_customer
    @car = Car.find(params[:id_car])
    @customer = Customer.find(params[:id_customer])
    @admin=Admin.find(params[:id_admin])