app/controllers/cars_controller.rb

  def index
    @cars = if current_authority == $customer
                 Car.where('status != ? or customer_id = ?', $suggested, current_user.id)# display suggested car by customer self
               else
                 Car.all
---
SELECT "cars".* FROM "cars"

  def create
    params[:car][:status] = if current_authority == $customer
                              $suggested
                            else
                              $available
                            end
    @car = Car.new(car_params)
    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("license", "manufacturer", "model", "rate", "style", "location", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Available"], ["updated_at", "2017-09-26 01:14:37.922753"], ["id", 1]]

  def set_customer
    @customer = if current_authority != $customer
                  if params.key?(:customer) && params[:customer].key?(:customer_id)
                    Customer.find(params[:customer][:customer_id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]