app/controllers/customers_controller.rb

  def index
    if !logged_in?
      redirect_to login_url
    elsif current_authority == $customer
      redirect_to customer_url(current_user)
    end
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def search
    #  set_customer if @customer.nil?
    q = params[:q]
    if q.nil? || q.blank?
      @cars = Car.all
---
SELECT "cars".* FROM "cars" WHERE (lower(Location) = '401')

  def create
    customer_params[:email].downcase!
    @customer = Customer.new(customer_params)
    @customer.charge = 0
    @customer.status = $returned
    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("name", "email", "password_digest", "charge", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def set_customer
    # if @customer.nil?
    if params[:id]!=nil
      @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def set_car
    if params[:id]!=nil
      @car = Car.find(params[:id])
---
SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]