app/controllers/sessions_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "user1@email.com"], ["LIMIT", 1]]
SELECT  "super_admins".* FROM "super_admins" WHERE "super_admins"."email" = ? LIMIT ?  [["email", "user1@email.com"], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "user1@email.com"], ["LIMIT", 1]]
---
  def create
    user = SuperAdmin.find_by(email: params[:session][:email].downcase)
    user = Admin.find_by(email: params[:session][:email].downcase) if user==nil
    user = Customer.find_by(email: params[:session][:email].downcase) if user==nil