app/controllers/sessions2_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "admin1@email.com"], ["LIMIT", 1]]
---
  def create
    user = Admin.find_by(email: params[:session2][:email].downcase)