app/views/cars/show.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Relative to:</strong>
      <%= Customer.find_by(id: @car.customer_id).email %>

SELECT "customers".* FROM "customers"
---
            <%= f.label :customer_id, 'Customer' %>
            <%= collection_select :customer, :customer_id, Customer.all, :id, :email %>